import random
import numpy as np

First_Names = ['ვენერა', 'თინა', 'თეა', 'სოსო', 'მირანდა', 'ჟენია', 'ტატიანა', 'ედუარდ', 'კლარა', 'სიმონ', 'ანზორ',
               'სოფია', 'სოსო', 'ნელი', 'ბონდო', 'ედუარდ', 'სონია', 'არჩილ', 'მარიამ', 'სოფია', 'ემა', 'იზოლდა', 'ომარ',
               'ტატიანა', 'ვიქტორ', 'კარინე', 'გუგული', 'კახა', 'როზა', 'რუსუდან', 'სიმონ', 'ნელი', 'ბადრი', 'მადონა',
               'ირინე', 'მინდია', 'ნათია', 'გულნარა', 'კახა', 'ელზა', 'როინ', 'ნაირა', 'ლიანა', 'ნინელი', 'მაყვალა',
               'რეზო', 'ჟუჟუნა', 'ზინა', 'გოჩა', 'მურმან']
Last_Names = ['ქუთათელაძე', 'მეგრელიშვილი', 'სალუქვაძე', 'ხარაიშვილი', 'შელია', 'კევლიშვილი', 'ბუჩუკური', 'ტყებუჩავა',
              'მიქაბერიძე', 'ურუშაძე', 'ძიძიგური', 'გოგუაძე', 'ანთაძე', 'ვალიევა', 'როგავა', 'ნაკაშიძე', 'ღურწკაია',
              'გვაზავა', 'გვასალია', 'ზარანდია', 'სხირტლაძე', 'ბერაძე', 'ხვიჩია', 'ბასილაშვილი', 'კაკაბაძე',
              'მერებაშვილი', 'ნოზაძე', 'ხარაბაძე', 'მუსაევა', 'მამულაშვილი', 'ელიზბარაშვილი', 'მამულაშვილი', 'ჯოჯუა',
              'გულუა', 'ხალვაში', 'ხარატიშვილი', 'დუმბაძე', 'ბერიანიძე', 'ჯოხაძე', 'სამხარაძე', 'ლიპარტელიანი',
              'იობიძე', 'გაბაიძე', 'ხარაბაძე', 'ინასარიძე', 'ბერაძე', 'შენგელია', 'ქობალია', 'მიქავა', 'რევაზიშვილი']
SUBJECTS = ['ინგლისური', 'ქართული', 'მათემატიკა', 'ფიზიკა', 'ქიმია', 'ბიოლოგია', 'ისტორია', 'გეოგრაფია', 'ეკონომიკა', 'პოლიტიკა',
            'ფილოსოფია', 'სოციოლოგია', 'პსიქოლოგია', 'ფინანსები', 'სპორტი', 'მუსიკა', 'ხელოვნება', 'კულინარია',
            'ტექნოლოგია', 'კომპიუტერი', 'ფოტოგრაფია', 'მედიცინა', 'ჯანდაცვა']

FULL_NAMES = [f'{first} {last}' for first in First_Names for last in Last_Names]


def generate_data(_set=None, k=100):
    return np.array(random.sample(_set, k=k))
